WCF/Lesson4WCFDataContractsAndMembers/TeacherServiceHost/app_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-01T20:26:17.1319929Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{40674fbf-66ca-44ec-b3a6-8d636f618ab7}" /><Execution ProcessName="TeacherServiceHost" ProcessID="16428" ThreadID="7" /><Channel/><Computer>MANISHPC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-02T01:56:17.1223224+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5NX4HXV0bdJkmDkZyNR2sIAAAAABEsWb9XDlE6ZpxVgsvufOacSvjby9CxHnweLT/SHXnUACQAA</VsDebuggerCausalityData><SOAPAction>"http://tempuri.org/ITeacherService/ShowAllDepartments"</SOAPAction><Connection>Keep-Alive</Connection><Content-Length>143</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:8090</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:8090/MyTeacher</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ITeacherService/ShowAllDepartments</Action></s:Header><s:Body><ShowAllDepartments xmlns="http://tempuri.org/"></ShowAllDepartments></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-01T20:26:17.2456181Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{40674fbf-66ca-44ec-b3a6-8d636f618ab7}" /><Execution ProcessName="TeacherServiceHost" ProcessID="16428" ThreadID="7" /><Channel/><Computer>MANISHPC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-02T01:56:17.2456181+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ITeacherService/ShowAllDepartmentsResponse</Action></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="9155fd11-ee6a-46f8-bc43-ddab37f4e235" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><ShowAllDepartmentsResponse xmlns="http://tempuri.org/"><ShowAllDepartmentsResult xmlns:a="http://schemas.datacontract.org/2004/07/System.Web.UI.WebControls" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Physics</a:Text><a:Value>100</a:Value></a:ListItem><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Chemistry</a:Text><a:Value>101</a:Value></a:ListItem><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Mathematics</a:Text><a:Value>102</a:Value></a:ListItem><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Social Studies</a:Text><a:Value>103</a:Value></a:ListItem><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Biology</a:Text><a:Value>104</a:Value></a:ListItem><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Pyschology</a:Text><a:Value>105</a:Value></a:ListItem><a:ListItem><a:Enabled>true</a:Enabled><a:Selected>false</a:Selected><a:Text>Sociology</a:Text><a:Value>106</a:Value></a:ListItem></ShowAllDepartmentsResult></ShowAllDepartmentsResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-01T20:26:21.3706805Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{632f9c88-0db6-4a31-8324-de5c7be60673}" /><Execution ProcessName="TeacherServiceHost" ProcessID="16428" ThreadID="5" /><Channel/><Computer>MANISHPC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-02T01:56:21.3706805+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo5RX4HXV0bdJkmDkZyNR2sIAAAAABEsWb9XDlE6ZpxVgsvufOacSvjby9CxHnweLT/SHXnUACQAA</VsDebuggerCausalityData><SOAPAction>"http://tempuri.org/ITeacherService/ShowTeacherByID"</SOAPAction><Content-Length>168</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Accept-Encoding>gzip, deflate</Accept-Encoding><Expect>100-continue</Expect><Host>localhost:8090</Host></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:8090/MyTeacher</To><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ITeacherService/ShowTeacherByID</Action></s:Header><s:Body><ShowTeacherByID xmlns="http://tempuri.org/"><ID>12</ID></ShowTeacherByID></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-03-01T20:26:21.3803271Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{632f9c88-0db6-4a31-8324-de5c7be60673}" /><Execution ProcessName="TeacherServiceHost" ProcessID="16428" ThreadID="5" /><Channel/><Computer>MANISHPC</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-03-02T01:56:21.3803271+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ITeacherService/ShowTeacherByIDResponse</Action></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="dcc497cf-18da-40fa-9c7d-8ba82af2422a" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><ShowTeacherByIDResponse xmlns="http://tempuri.org/"><ShowTeacherByIDResult i:type="b:FullTimeTeacher" xmlns:a="https://manish.kumar.net/TeacherItem/03/01/2020" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:b="http://schemas.datacontract.org/2004/07/TeacherObject"><a:TeacherID>0</a:TeacherID><a:TeacherName>Nitish Kumar</a:TeacherName><a:Gender>Female</a:Gender><a:TeacherQualification>BTech</a:TeacherQualification><a:Department xmlns:c="https://manish.kumar.net/DepartmentItem/03/01/2020"><c:DeptID>104</c:DeptID><c:Name>Biology</c:Name></a:Department><a:Success>true</a:Success><a:Type>FullTimeTeacher</a:Type><b:AnnualPackage>76799</b:AnnualPackage></ShowTeacherByIDResult></ShowTeacherByIDResponse></s:Body></s:Envelope></MessageLogTrac